system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(   (1.25 -10.75 0)   //0
    (-1.25 -10.75 0)  //1
    (-2.70 -1.75  0)  //2
    (2.70 -1.75 0)    //3
    (2.8  -1.25 0)    //4
    (-2.8  -1.25 0)   //5 
    (-3 0 0)          //6
    (3 0 0)           //7
    (3 5 0)           //8
    (-3 5 0)          //9
    (-3 6 0)       //10
    (3 6 0)        //11
    (3 15 0)  	      //12
    (-3 15 0)         //13
    (1.25 -10.75 0.1)   //14
    (-1.25 -10.75 0.1)  //15
    (-2.70 -1.75 0.1)   //16
    (2.70 -1.75 0.1)    //17
    (2.8  -1.25 0.1)    //18
    (-2.8  -1.25 0.1)   //19 
    (-3 0 0.1)          //20
    (3 0 0.1)           //21
    (3 5 0.1)          //22
    (-3 5 0.1)           //23
    (-3 6 0.1)        //24
    (3 6 0.1)       //25
    (3 15 0.1)         //26
    (-3  15 0.1)  	 //27
);

blocks
(
    hex (1 0 3 2 15 14 17 16) porosity (60 50 1) simpleGrading (1 1 1)
    hex (2 3 4 5 16 17 18 19) porosity (60 4 1) simpleGrading (1 1 1)
    hex (5 4 7 6 19 18 21 20) porosity  (60 10 1) simpleGrading (1 1 1)
    hex (6 7 8 9 20 21 22 23) porosity  (60 40 1) simpleGrading (1 1 1)
    hex (9 8 11 10 23 22 25 24) porosity  (60 4 1) simpleGrading (1 1 1)
    hex (10 11 12 13 24 25 26 27) porosity  (60 100 1) simpleGrading (1 1 1)   
);

edges
(
);

boundary
(
    outlet
    {
        type patch;
        faces
        (
            (26 27 13 12)
        );
    }
    inlet2
    {
       type patch;
       faces 
       (
           (8 11 25 22)
       );
    }
    inlet1
    {
       type patch;
       faces 
       (
           (23 24 10 9)
       );
    }
 
    outletSolid
    {
       type patch;
        faces
        (
            (15 1 0 14)
        );
    }

    coolingOutlet1
    {
       type patch;
        faces
        (
           (16 19 5 2)
          
        );
    }

    coolingOutlet2
    {
       type patch;
        faces
        (
            (3 4 18 17)
           
        );
    }

    fixedWalls
    {
        type wall;
        faces
        (
            (15 16 2 1)
            (20 23 9 6)
            (19 20 6 5)
            (24 13 27 10)
            (11 12 26 25)
            (7 8 22 21)
            (4 7 21 18)
            (0 3 17 14)
        );
    }
    frontAndBack
    {
        type empty; 
        faces
        (
            (15 16 17 14)
            (16 19 18 17)
            (19 20 21 18)
            (20 23 22 21)
            (23 24 25 22)
            (24 27 26 25)
            (1 2 3 0)
            (2 5 4 3)
            (5 6 7 4)
            (6 9 8 7)
            (9 10 11 8)
            (10 13 12 11)            
        );
    }
);

mergePatchPairs
(
);

// ************************************************************************* //
