constant/fvOptions
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.0                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


porosityBlockage
{
    type            explicitPorositySource;
    active          yes;

   
    explicitPorositySourceCoeffs
    {  
       selectionMode   cellZone;
       cellZone        porosity; 
       type            DarcyForchheimer;

        DarcyForchheimerCoeffs
        {
    	// e 0.35
    	 d   (1e4 1e4 1e10);
         f   (0 0 0);

            coordinateSystem
            {
            type    cartesian;  
            origin  (0 0 0);    
            coordinateRotation
            {
                   type    axesRotation; // local Cartesian co-ordinates
                    e1      (1 0 0);
                    e2      (0 1 0);
                }
            }
        }
    }
 
   
}





// ************************************************************************* //
