constant/gasTransportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
CO
{
    diffusionModel  constant;
    D           D           [0 2 -1 0 0 0 0] 5.2e-10;
}
    
CO2
{
    diffusionModel  constant;
    D           D           [0 2 -1 0 0 0 0] 1.6e-9;
}
 
/*N2
{
    diffusionModel  constant;
    D           D           [0 2 -1 0 0 0 0] 3.6e-9;
}*/
H2
{
    diffusionModel  constant;
    D           D           [0 2 -1 0 0 0 0] 4.6e-10;
}
    
H2O
{
    diffusionModel  constant;
    D           D           [0 2 -1 0 0 0 0] 1.8e-9;
}

CH4
{
    diffusionModel  constant;
    D           D           [0 2 -1 0 0 0 0] 3.5e-9;
}
