constant/solidTransportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
Fe
{
    diffusionModel  constant;
    D           D           [0 2 -1 0 0 0 0] 0.0;
}
    
FeO
{
    diffusionModel  constant;
    D           D           [0 2 -1 0 0 0 0] 0.0;
}
 

