constant/transportProperties
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

transportModel  Newtonian;

nu              [0 2 -1 0 0 0 0] 1.5e-05;
DTSolid         DTSolid [0 2 -1 0 0 0 0] 1e-5;
DTGas           DTGas [0 2 -1 0 0 0 0] 2e-5;
heffSolid       heffSolid [0 0 -1 0 0 0 0] 1;
heffGas         heffGas [0 0 -1 0 0 0 0] 1;
phases          (solid gas);
speciesNames     (solidNames gasNames);    
gasNames    (CO CO2 H2 H2O CH4);
solidNames  (Fe2O3 Fe);

massTransGasCO      massTransGasCO [0 2 -1 0 0 0 0] 1.5e-4 ;
massTransGasCO2     massTransGasCO2 [0 2 -1 0 0 0 0] 1e-4 ;
massTransGasCH4     massTransGasCH4 [0 2 -1 0 0 0 0] 2e-4 ;
massTransGasH2      massTransGasH2 [0 2 -1 0 0 0 0] 1e-4 ;
massTransGasH2O     massTransGasH2O [0 2 -1 0 0 0 0] 2e-4;
inertSpecieGas    Fe2O3;
inertSpecieSolid  CO;
// ************************************************************************* //
