0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    fixedWalls
    {
        type            noSlip;
      
    }
    outletSolid
    {
       type            flowRateInletVelocity;
        volumetricFlowRate  constant 25;
    }
    coolingOutlet1
    {
        type            inletOutlet;
        value           uniform (0 0 0);
        inletValue      uniform (0 0 0);
    }
    coolingOutlet2
    {
         type            inletOutlet;
        value           uniform (0 0 0);
        inletValue      uniform (0 0 0);
    }
    inlet1
    {
        type            flowRateInletVelocity;
        volumetricFlowRate  constant 64;
    }
    inlet2
    {
        type            flowRateInletVelocity;
        volumetricFlowRate  constant 64;
    }
    outlet
    {
        type            inletOutlet;
        value           uniform (0 0 0);
        inletValue      uniform (0 0 0);
    }
    }
}

// ************************************************************************* //
