0/p
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 180000;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    fixedWalls
    {
        type            zeroGradient;
    }
    outletSolid
    {
        type            fixedValue;
        value           $internalField;
     }
    
   coolingOutlet1
    {
        type            totalPressure;
        p0              177325;
    }
    coolingOutlet2
    {
        type            totalPressure;
        p0              177325;
    }

    inlet1
    {
        type            fixedValue;
        value           $internalField;
    }
    inlet2
    {
         type            fixedValue;
        value           $internalField;
    }
    outlet
    {
         type            totalPressure;
        p0               144325;
       
    }
}

// ************************************************************************* //
