0/T.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    fixedWalls
    {
        type          zeroGradient;
     }
    outletSolid
    {
     
        type            uniformFixedValue;
        uniformValue    constant 314;
        value           uniform 314;
    }
    coolingOutlet1
    {
        type            zeroGradient;
      
    }
    coolingOutlet2
    {
        type            zeroGradient;
      
    }

    inlet1
    {
        type            uniformFixedValue;
         uniformValue    constant 1233;
        value           uniform 1233;
    }
    inlet2
    {
        type            uniformFixedValue;
         uniformValue    constant 1233;
        value           uniform 1233;
    }
    outlet
      {
         type            zeroGradient;
 
    }
}

// ************************************************************************* //
