0/TSolid.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      TSolid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 298;

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    fixedWalls
    {
        type          zeroGradient;
    }
    outletSolid
    {
        type           zeroGradient;
    }

    inlet1
    {
       type           zeroGradient;
    }
    inlet2
    {
        type           zeroGradient; 
    }
    coolingOutlet1
    {
       type           zeroGradient;
    }
    coolingOutlet2
    {
        type           zeroGradient; 
    }
    outlet
      {
         type            uniformFixedValue;
         uniformValue    constant 298;
         value           uniform 298;
    }
}

// ************************************************************************* //
