0/USolid.orig
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volVectorField;
    object      USolid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    frontAndBack
    {
        type            empty;
    }
    fixedWalls
    {
        type           noSlip;
     }
    outletSolid
    {
     type               zeroGradient;
    }

    inlet1
    {
       type           noSlip;
          }
    inlet2
    {
        type            noSlip; 
    }
     coolingOutlet1
    {
       type           noSlip;
    }
    coolingOutlet2
    {
        type            noSlip; 
    }
    outlet
      {
        type            uniformFixedValue;
        uniformValue    constant (0 -100 0);
        value           uniform (0 -100 0);
    }
}

// ************************************************************************* //
