0/gasC_CH4
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      CH4;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 -3 0 0 1 0 0];

internalField   uniform 0;

boundaryField
{


   frontAndBack
    {
        type                empty;
    }
    fixedWalls
    {
        type               zeroGradient;
     }
    outletSolid
    {
     type                  zeroGradient;
    }

    coolingOutlet1
    {
        type               zeroGradient;
    }
    coolingOutlet2
    {
        type               zeroGradient;
    }

    inlet1
    {
        type            fixedValue;
        value            uniform 0.03;
    }
    inlet2
    {
        type            fixedValue;
        value            uniform 0.03;
    }
    outlet
      {
          type            fixedValue;
          value            uniform 0.03;
 
    }
}


// ************************************************************************* //
