0/gasC_H2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      H2;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   uniform 0;

boundaryField
{
      frontAndBack
    {
        type            empty;
    }
    fixedWalls
    {
        type          zeroGradient;
     }
    outletSolid
    {
     type               zeroGradient;
    }

    inlet1
    {
        type            fixedValue;
       value            uniform 0.60;
    }
    inlet2
    {
        type            fixedValue;
       value            uniform 0.60;
    }
    outlet
      {
          type            inletOutlet;
        inletValue      uniform 0.0;
        value           uniform 0.0;
 
    }
    coolingOutlet1
    {
        type               zeroGradient;
    }
    coolingOutlet2
    {
        type               zeroGradient;
    }
}


// ************************************************************************* //
