0/phiSolid
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       surfaceScalarField;
    location    "0";
    object      phiSolid;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 3 -1 0 0 0 0];

internalField   nonuniform List<scalar> 
24692
(
-0.16411
-1.09162
-0.276084
-1.07958
-0.344384
-1.07571
-0.383794
-1.0686
...
)
;

boundaryField
{
    outlet
    {
        type            calculated;
        value           nonuniform List<scalar> 
60
(
-1
-1
-1
-1
-1
-1
-1
-1
...
)
;
    }
    inlet2
    {
        type            calculated;
        value           uniform 0;
    }
    inlet1
    {
        type            calculated;
        value           uniform 0;
    }
    outletSolid
    {
        type            calculated;
        value           nonuniform List<scalar> 
60
(
1.25573
1.19156
1.14401
1.10801
1.08017
1.05815
1.04038
1.02577
...
)
;
    }
    coolingOutlet1
    {
        type            calculated;
        value           uniform 0;
    }
    coolingOutlet2
    {
        type            calculated;
        value           uniform 0;
    }
    fixedWalls
    {
        type            calculated;
        value           uniform 0;
    }
    frontAndBack
    {
        type            empty;
        value           nonuniform 0();
    }
}


// ************************************************************************* //
