system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default         steadyState;
}

gradSchemes
{
    default         Gauss linear;
}

divSchemes
{
    default         none;   
    div(phiSolid,USolid)      bounded Gauss linear;
    div(div(phiSolid,USolid)) Gauss linear;
    div(phi,U)      bounded Gauss upwind;
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
    div(phi,epsilon) bounded Gauss upwind;
    div(phi,k)      bounded Gauss upwind;
    div(phiSolid,TSolid)      Gauss linearUpwind grad(TSolid);
    div(phi,T)      Gauss linearUpwind grad(T);
    div(phi,C_gasComponents)      Gauss upwind;
    div(phi,C_solidComponents)      Gauss upwind;
    laplacian(D,C_gasComponents)    Gauss linear corrected;
    laplacian(D,C_solidComponents)    Gauss linear corrected;
}

laplacianSchemes
{
    default          Gauss linear corrected;
 
}

interpolationSchemes
{
    default         linear;
}

snGradSchemes
{
    default         corrected;
}






// ************************************************************************* //









