system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
       PhiSolid
    {
        solver          GAMG;
        smoother        DIC;

        tolerance       1e-08;
        relTol          0.01;
    }

    pSolid
    {
        $PhiSolid;
    }


    p
    {
        solver          GAMG;
        tolerance       1e-08;
        relTol          0.05;
        smoother        GaussSeidel;
        nCellsInCoarsestLevel 20;
    }

    "(U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-08;
        relTol          0.1;
    }
    TSolid
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
    }
     T
    {
        solver          PBiCGStab;
        preconditioner  DILU;
        tolerance       1e-08;
        relTol          0;
    }
    
    "(gasC_.*|solidC_.*)"
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-7;
        relTol           0;
    };

}

simple
{
    nUCorrectors    2;
    nNonOrthogonalCorrectors 3;
}

relaxationFactors
{
    fields
    {
        p              0.3;
	
    }
    equations
    {
        U               0.7;
        k               0.9;
        epsilon         0.9;
        TSolid          0.7;
	T               0.7;
    }
}


// ************************************************************************* //
